function [q, qd, qdd] = Cubic_polynomial_interpolation(q0, q1, qd0, qd1, T, t)
    % 给定初末位置、速度、总时间，返回三次插值后，在时间t（0<t<T）的位置、速度、加速度，t也可以是时间序列
    A = [  0  ,  0 , 0, 1;
         T^3  , T^2, T, 1;
         0    ,  0 , 1, 0;
         3*T^2, 2*T, 1, 0];
    
    B = [q0; q1; qd0; qd1];
    
    % 求解系数矩阵
    p = A \ B;

    % 计算位置、速度、加速度
    q = p(1, :)' * t.^3 + p(2, :)' * t.^2 + p(3, :)' * t + p(4, :)';
    qd = 3 * p(1, :)' * t.^2 + 2 * p(2, :)' * t + p(3, :)';
    qdd = 6 * p(1, :)' * t + 2 * p(2, :)';

end